In [19]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from datetime import datetime
from datetime import date,timedelta
from datetime import date

In [20]:
df_cab = pd.read_csv('Cab_Data.csv')
df_city = pd.read_csv('City.csv')
df_cusid = pd.read_csv('Customer_ID.csv')
df_transid = pd.read_csv('Transaction_ID.csv')
df_holiday= pd.read_csv('Holiday.csv')

In [21]:
for i in range(359392):
    df_cab['Date of Travel'][i] = date(1900,1,1)+timedelta(int(df_cab['Date of Travel'][i])-2)
df_cab.head(5)

C:\Users\Ruizhe Zhang\AppData\Local\Temp/ipykernel_20072/4241785755.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_cab['Date of Travel'][i] = date(1900,1,1)+timedelta(int(df_cab['Date of Travel'][i])-2)

,Transaction ID,Date of Travel,Company,City,KM Travelled,Price Charged,Cost of Trip
0,10000011,2016-01-08,Pink Cab,ATLANTA GA,30.45,370.95,313.635
1,10000012,2016-01-06,Pink Cab,ATLANTA GA,28.62,358.52,334.854
2,10000013,2016-01-02,Pink Cab,ATLANTA GA,9.04,125.20,97.632
3,10000014,2016-01-07,Pink Cab,ATLANTA GA,33.17,377.40,351.602
4,10000015,2016-01-03,Pink Cab,ATLANTA GA,8.73,114.62,97.776

In [22]:
df1 = df_cab.merge(df_transid, how='left', on='Transaction ID').merge(df_cusid, how='left', on='Customer ID').dropna()
df1['Revenue']=df1['Price Charged']-df1['Cost of Trip']
df1.head()

,Transaction ID,Date of Travel,Company,City,KM Travelled,Price Charged,Cost of Trip,Customer ID,Payment_Mode,Gender,Age,Income (USD/Month),Revenue
0,10000011,2016-01-08,Pink Cab,ATLANTA GA,30.45,370.95,313.635,29290,Card,Male,28,10813,57.315
1,10000012,2016-01-06,Pink Cab,ATLANTA GA,28.62,358.52,334.854,27703,Card,Male,27,9237,23.666
2,10000013,2016-01-02,Pink Cab,ATLANTA GA,9.04,125.20,97.632,28712,Cash,Male,53,11242,27.568
3,10000014,2016-01-07,Pink Cab,ATLANTA GA,33.17,377.40,351.602,28020,Cash,Male,23,23327,25.798
4,10000015,2016-01-03,Pink Cab,ATLANTA GA,8.73,114.62,97.776,27182,Card,Male,33,8536,16.844

In [23]:
df_tmp = df1[['City','KM Travelled','Price Charged','Revenue']].groupby(by='City').sum()
df_tmp
df_tmp['Number of Rides'] = df1.groupby(by='City').count()['Transaction ID']
df2 = df_city.merge(df_tmp,how='left',on='City').set_index('City').dropna()
df2['Avg Revenue'] = df2['Revenue']/df2['Number of Rides']
df2

,Population,Users,KM Travelled,Price Charged,Revenue,Number of Rides,Avg Revenue
City,,,,,,,
NEW YORK NY,"8,405,837","302,149",2248809.74,56954061.67,2.796256e+07,99885.0,279.947491
CHICAGO IL,"1,955,130","164,468",1281704.39,19841318.52,3.387313e+06,56625.0,59.820104
LOS ANGELES CA,"1,595,037","144,132",1088735.65,17795624.41,4.411709e+06,48033.0,91.847452
MIAMI FL,"1,339,155","17,675",145418.17,2580135.20,7.583012e+05,6454.0,117.493220
SILICON VALLEY,"1,177,609","27,247",193712.97,3684102.15,1.316705e+06,8519.0,154.561013
ORANGE COUNTY,"1,030,185","12,994",88826.69,1554873.21,4.570019e+05,3982.0,114.766920
SAN DIEGO CA,"959,307","69,995",460503.69,7136380.59,1.587163e+06,20488.0,77.467955
PHOENIX AZ,"943,999","6,133",45825.08,756682.64,1.929409e+05,2064.0,93.479109
DALLAS TX,"942,908","22,157",157782.05,3142429.91,1.128733e+06,7017.0,160.856957
ATLANTA GA,"814,885","24,701",168643.76,2980241.72,8.424329e+05,7557.0,111.477158
DENVER CO,"754,233","12,421",85869.75,1462531.51,3.975850e+05,3825.0,103.943793
AUSTIN TX,"698,371","14,978",109207.30,1877142.50,5.267010e+05,4896.0,107.577824
SEATTLE WA,"671,238","25,063",180903.99,2854316.26,6.046849e+05,7997.0,75.613962
TUCSON AZ,"631,442","5,712",43229.81,672580.26,1.402607e+05,1931.0,72.636300
SACRAMENTO CA,"545,776","7,044",53861.20,761611.95,1.173262e+05,2367.0,49.567466
PITTSBURGH PA,"542,085","3,643",29705.76,442538.64,8.516596e+04,1313.0,64.863638
WASHINGTON DC,"418,859","127,001",989037.66,16366703.83,3.492870e+06,43737.0,79.860762
NASHVILLE TN,"327,225","9,270",68324.74,959108.13,1.495322e+05,3010.0,49.678478
BOSTON MA,"248,968","80,021",670388.18,10359755.42,1.768719e+06,29692.0,59.568883